{"security": {"SEC 5. How do you protect your network resources?": {"UnselectedChoices": ["Automate network protection", "Implement inspection and protection"], "Risk": "MEDIUM"}, "SEC 7. How do you classify your data?": {"UnselectedChoices": ["Automate identification and classification"], "Risk": "MEDIUM"}, "SEC 8. How do you protect your data at rest?": {"UnselectedChoices": ["Automate data at rest protection"], "Risk": "MEDIUM"}, "SEC 9. How do you protect your data in transit?": {"UnselectedChoices": ["Automate detection of unintended data\n               access", "Authenticate network communications"], "Risk": "MEDIUM"}}, "reliability": {"REL 1. How do you manage service quotas and constraints?": {"UnselectedChoices": ["Automate quota management", "Ensure that a sufficient gap exists between the current quotas and the maximum usage to accommodate failover"], "Risk": "MEDIUM"}, "REL 2. How do you plan your network topology?": {"UnselectedChoices": ["Prefer hub-and-spoke topologies over many-to-many mesh"], "Risk": "MEDIUM"}, "REL 6. How do you monitor workload resources?": {"UnselectedChoices": ["Analytics", "Conduct reviews regularly", "Monitor end-to-end tracing of requests through your system"], "Risk": "MEDIUM"}, "REL 7. How do you design your workload to adapt to changes in demand?": {"UnselectedChoices": ["Load test your workload"], "Risk": "MEDIUM"}, "REL 8. How do you implement change?": {"UnselectedChoices": ["Integrate resiliency testing as part of your deployment", "Deploy using immutable infrastructure", "Deploy changes with automation"], "Risk": "MEDIUM"}, "REL 9. How do you back up data?": {"UnselectedChoices": ["Perform periodic recovery of the data to verify backup integrity and processes"], "Risk": "MEDIUM"}, "REL 10. How do you use fault isolation to protect your workload?": {"UnselectedChoices": ["Use bulkhead architectures to limit scope of impact", "Automate recovery for components constrained to a single location"], "Risk": "MEDIUM"}}, "performance": {"PERF 6. How do you evolve your workload to take advantage of new releases?": {"UnselectedChoices": ["Define a process to improve workload performance"], "Risk": "MEDIUM"}}, "costOptimization": {"COST 4. How do you decommission resources?": {"UnselectedChoices": ["Enforce data retention policies"], "Risk": "MEDIUM"}}, "sustainability": {"SUS 1. How do you select Regions for your workload?": {"UnselectedChoices": ["Choose Region based on both business requirements and sustainability goals"], "Risk": "MEDIUM"}, "SUS 3. How do you take advantage of software and architecture patterns to support your sustainability goals?": {"UnselectedChoices": ["Optimize software and architecture for asynchronous and scheduled jobs", "Remove or refactor workload components with low or no use", "Optimize areas of code that consume the most time or resources", "Optimize impact on devices and equipment", "Use software patterns and architectures that best support data access and storage patterns"], "Risk": "MEDIUM"}, "SUS 4. How do you take advantage of data management policies and patterns to support your sustainability goals?": {"UnselectedChoices": ["Use elasticity and automation to expand block storage or file system", "Back up data only when difficult to recreate"], "Risk": "MEDIUM"}, "SUS 5. How do you select and use cloud hardware and services in your architecture to support your sustainability goals?": {"UnselectedChoices": ["Use managed services"], "Risk": "MEDIUM"}, "SUS 6. How do your organizational processes support your sustainability goals?": {"UnselectedChoices": ["Adopt methods that can rapidly introduce sustainability improvements", "Increase utilization of build environments", "Use managed device farms for testing"], "Risk": "MEDIUM"}}}