{"security": {"SEC 3. How do you manage permissions for people and machines?": {"UnselectedChoices": ["Establish emergency access process", "Reduce permissions continuously", "Share resources securely within your organization", "Share resources securely with a third party", "Manage access based on life cycle", "Analyze public and cross-account access"], "Risk": "MEDIUM"}}, "reliability": {"REL 2. How do you plan your network topology?": {"UnselectedChoices": ["Ensure IP subnet allocation accounts for expansion and availability", "Prefer hub-and-spoke topologies over many-to-many mesh", "Enforce non-overlapping private IP address ranges in all private address spaces where they are connected"], "Risk": "MEDIUM"}, "REL 7. How do you design your workload to adapt to changes in demand?": {"UnselectedChoices": ["Load test your workload"], "Risk": "MEDIUM"}}, "costOptimization": {"COST 1. How do you implement cloud financial management?": {"UnselectedChoices": ["Monitor cost proactively", "Quantify business value from cost optimization", "Report and notify on cost optimization"], "Risk": "MEDIUM"}}, "sustainability": {"SUS 1. How do you select Regions for your workload?": {"UnselectedChoices": ["Choose Region based on both business requirements and sustainability goals"], "Risk": "MEDIUM"}, "SUS 2. How do you align cloud resources to your demand?": {"UnselectedChoices": ["Scale workload infrastructure dynamically", "Optimize geographic placement of workloads based on their networking requirements", "Align SLAs with sustainability goals", "Stop the creation and maintenance of unused assets", "Optimize team member resources for activities performed", "Implement buffering or throttling to flatten the demand curve"], "Risk": "MEDIUM"}, "SUS 3. How do you take advantage of software and architecture patterns to support your sustainability goals?": {"UnselectedChoices": ["Optimize software and architecture for asynchronous and scheduled jobs", "Remove or refactor workload components with low or no use", "Optimize areas of code that consume the most time or resources", "Optimize impact on devices and equipment", "Use software patterns and architectures that best support data access and storage patterns"], "Risk": "MEDIUM"}, "SUS 4. How do you take advantage of data management policies and patterns to support your sustainability goals?": {"UnselectedChoices": ["Implement a data classification policy", "Use policies to manage the lifecycle of your datasets", "Use elasticity and automation to expand block storage or file system", "Remove unneeded or redundant data", "Use shared file systems or storage to access common data", "Minimize data movement across networks", "Back up data only when difficult to recreate", "Use technologies that support data access and storage patterns"], "Risk": "MEDIUM"}, "SUS 5. How do you select and use cloud hardware and services in your architecture to support your sustainability goals?": {"UnselectedChoices": ["Use the minimum amount of hardware to meet your needs", "Use instance types with the least impact", "Use managed services", "Optimize your use of hardware-based compute accelerators"], "Risk": "MEDIUM"}, "SUS 6. How do your organizational processes support your sustainability goals?": {"UnselectedChoices": ["Adopt methods that can rapidly introduce sustainability improvements", "Keep your workload up-to-date", "Increase utilization of build environments", "Use managed device farms for testing"], "Risk": "MEDIUM"}}}